package com.atguigu.exam;

/**
 * @description: First
 * @author: yangjiang
 * @create: 2020-10-15 08:55
 **/
public class MyFirstExam {
    public static void main(String[] args) {
        /**
         * 1、先查询出所有考点及其对应的考场个数
         * 2、查询出所有的科目总数
         * 3、每个考场的座位数
         * 4、查询出所有的考生及其对应的报考科目（通过个人唯一识别码对应报考科目）
         * 5、通过个人唯一识别码进行排序，只要个人唯一识别码进入一个考场，那么这个个人唯一识别码对应的所有的考试
         * 都应该在同一个考点（此处应该进行判断，如果此考点只剩下一个座位，那么由于这个人还要报考其他的考试考场，所以就应该把这个人
         * 的考场全部安排在下一个考点）
         *
         * */
    }
}
